Repository: RoadTripMoustache/iris-doc
Catalog: docs/source/locale/*/LC_MESSAGES/getting_started/configuration.po
Languages: fr

source: This section details all the configurations available for each service.
fr: Cette section détaille toutes les configurations disponibles pour chaque service.

source: All the following configurations must be defined in a **yaml file**. By default, it's in `config.yaml` which needs to be at the same place as the code.
fr: Toutes les configurations doivent être définies dans un **fichier yaml**. Par défaut c'est dans `config.yaml` qui a besoin d'être dans le dossier où le code est exécuté.

source: But you can change this path by defining the environment variable `CONFIG_FILE_PATH`.
fr: Mais vous pouvez changer ce chemin en définissant la variable d'environnement `CONFIG_FILE_PATH`.

source: YAML Structure
fr: Structure YAML

source: Parameters
fr: Paramètres

source: **firebase.credentials_file_path** : *(Env variable : `FIREBASE_CREDENTIALS_FILE_PATH`)* - Path to the firebase credentials file
fr: **firebase.credentials_file_path** : *(Variable d'environnement : `FIREBASE_CREDENTIALS_FILE_PATH`)* - Chemin vers le fichier d'identifiants firebase

source: **firebase.project_id** : *(Env variable : `FIREBASE_PROJECT_ID`)* - Project id of the firebase
fr: **firebase.project_id** : *(Variable d'environnement : `FIREBASE_PROJECT_ID`)* - Identifiant du projet firebase

source: **firebase.mock.enabled** : *(Env variable : `FIREBASE_MOCK_ENABLED`)* - Set to `true` if you want to enable the mocks and do some specific tests.
fr: **firebase.mock.enabled** : *(Variable d'environnement : `FIREBASE_MOCK_ENABLED`)* - A mettre à `true` si vous voulez activez les mocks pour faire des tests spécifiques.

source: **firebase.mock.data_file_path** : *(Env variable : `FIREBASE_MOCK_DATA_PATH`)* - Path to the mock resources
fr: **firebase.mock.data_file_path** : *(Variable d'environnement : `FIREBASE_MOCK_DATA_PATH`)* - Chemin vers les ressources mockées

source: To get the file defined in `firebase.credentials_file_path`, check `this Firebase documentation <https://firebase.google.com/docs/admin/setup?hl=fr#set-up-project-and-service-account>`__ which explains how to configure a service account.
fr: Pour récupérer le fichier définit dans `firebase.credentials_file_path`, regardez `cette documentation Firebase <https://firebase.google.com/docs/admin/setup?hl=fr#set-up-project-and-service-account>`__ qui explique comment configure un service account.

source: Database
fr: Base de données

source: **database.mock.enabled** : *(Env variable : `DATABASE_MOCK_ENABLED`)* - Set to `true` if you want to enable the mocks and do some specific tests.
fr: **database.mock.enabled** : *(Variable d'environnement : `DATABASE_MOCK_ENABLED`)* - A mettre à `true` si vous voulez activer les mocks et faire des tests spécifiques.

source: **database.mock.data_file_path** : *(Env variable : `DATABASE_MOCK_DATA_PATH`)* - Path to the mock resources
fr: **database.mock.data_file_path** : *(Variable d'environnement : `DATABASE_MOCK_DATA_PATH`)* - Chemin vers les ressources de mock

source: **database.mongo.uri** : *(Env variable : `DATABASE_MONGO_URI`)* - URI path of the database
fr: **database.mongo.uri** : *(Variable d'environnement : `DATABASE_MONGO_URI`)* - URI pour se connecter à la base de données

source: **database.mongo.name** : *(Env variable : `DATABASE_MONGO_NAME`)* - Name of the collection to use in Mongo.
fr: **database.mongo.name** : *(Variable d'environnement : `DATABASE_MONGO_NAME`)* - Nom de la collection à utiliser dans Mongo.

source: Server
fr: Serveur

source: **server.expose** : *(Env variable : `SERVER_EXPOSE`)* - Port to expose the API. *Default 8080*
fr: **server.expose** : *(Variable d'environnement : `SERVER_EXPOSE`)* - Port exposant l'API. *Défaut 8080*

source: **server.metrics_expose** : *(Env variable : `SERVER_METRICS_EXPOSE`)* - Port to expose the API metrics. *Default 2121*
fr: **server.metrics_expose** : *(Variable d'environnement : `SERVER_METRICS_EXPOSE`)* - Port pour exposer les métriques de l'API. *Défaut 2121*

source: **server.origins_allowed** : List of the origins allowed to call the API
fr: **server.origins_allowed** : Liste des origines autorisées pour appeler l'API

source: **server.images_dir** : *(Env variable : `SERVER_IMAGES_DIR`)* - Folder where the images will be stored
fr: **server.images_dir** : *(Variable d'environnement : `SERVER_IMAGES_DIR`)* - Dossier où les images doivent être stockées

source: **server.images_base_url** : *(Env variable : `SERVER_IMAGES_BASE_URL`)* - Base path to call to get the images. By default need to be `/v1/images` if you use the API endpoint
fr: **server.images_base_url** : *(Variable d'environnement : `SERVER_IMAGES_BASE_URL`)* - Base de l'URL pour récupérer les images. Par défaut, cela doit être `/v1/images` si vous utilisez l'endpoint de l'API

source: **images.maxImagesPerIdea** : *(Env variable : `IMAGE_MAX_IMAGES_PER_IDEA`)* - Max number of images per idea
fr: **images.maxImagesPerIdea** : *(Variable d'environnement : `IMAGE_MAX_IMAGES_PER_IDEA`)* - Nombre maximum d'images par idée

source: **images.maxImagesPerComment** : *(Env variable : `IMAGE_MAX_IMAGES_PER_COMMENT`)* - Max number of images per comment
fr: **images.maxImagesPerComment** : *(Variable d'environnement : `IMAGE_MAX_IMAGES_PER_COMMENT`)* - Nombre maximum d'images par commentaire

source: **images.maxSize** : *(Env variable : `IMAGE_MAX_SIZE`)* - Image max size in bytes
fr: **images.maxSize** : *(Variable d'environnement : `IMAGE_MAX_SIZE`)* - Taille maximale des images en octets

source: **images.acceptedExtensions** : List of file extensions allowed for file upload.
fr: **images.acceptedExtensions** : Liste des extensions de fichier autorisées.

source: **admin.defaultList** : List of default administrator of the Iris instance
fr: **admin.defaultList** : Liste d'administrateur par défaut

source: Two json configurations files are required:
fr: Deux fichiers de configuration json sont requis:

source: **apiBaseUrl** : *[Mandatory]* Base url of the Iris API
fr: **apiBaseUrl** : *[Obligatoire]* URL pour appeler Iris API

source: **appTitle** : *[Optional]* App title to display instead of the default one
fr: **appTitle** : *[Optionnel]* Titre de l'application à afficher à la place du défaut

source: **appLoginTitle** : *[Optional]* Login title to display instead of the default one
fr: **appLoginTitle** : *[Optionnel]* Titre à afficher sur la page de connexion à la place du défaut

source: **appIcon** : *[Optional]* App icon to display instead of the default one
fr: **appIcon** : *[Optionnel]* Icone à afficher à la place de celle par défaut

source: **apiKey** : *[Mandatory]* Firebase API key
fr: **apiKey** : *[Obligatoire]* Clé Firebase API

source: **authDomain** : *[Mandatory]* Firebase Auth domain
fr: **authDomain** : *[Obligatoire]* Domaine d'authentification Firebase

source: **databaseURL** : *[Mandatory]* Firebase database URL
fr: **databaseURL** : *[Obligatoire]* URL vers la base de données Firebase

source: **projectId** : *[Mandatory]* Firebase project ID
fr: **projectId** : *[Obligatoire]* Identifiant du projet Firebase

source: **storageBucket** : *[Mandatory]* Firebase storage bucket
fr: **storageBucket** : *[Obligatoire]* Bucket de stockage Firebase

source: **messagingSenderId** : *[Mandatory]* Firebase messaging sender ID
fr: **messagingSenderId** : *[Obligatoire]* Identifiant du messaging sender de Firebase

source: **appId** : *[Mandatory]* Firebase app ID
fr: **appId** : *[Obligatoire]* Identifiant de l'application Firebase

source: These configurations can be found in the Firebase console. Check `this documentation <https://firebase.google.com/docs/web/learn-more#config-object>`__ to know how to retrieve these informations.
fr: Cette documentation peut être trouvée dans la console Firebase. Regardez `cette documentation <https://firebase.google.com/docs/web/learn-more#config-object>`__ pour savoir comment récupérer ces informations.
