Repository: RoadTripMoustache/iris-doc
Catalog: docs/source/locale/*/LC_MESSAGES/architecture/architecture.po
Languages: fr

source: How does it work?
fr: Comment ça marche ?

source: *Architecture of the iris service*
fr: Architecture d'Iris

source: The Iris architecture is quite simple.
fr: L'architecture d'Iris est assez simple.

source: **Iris frontend** exposes the web application. It uses the authentication service to log in the user and validate the user token. It also uses the Iris API to manage the ideas and other resources.
fr: **Iris frontend** exposes l'application web qui utilise le service d'authentification pour permettre à l'utilisateur de se connecter. Il utilise aussi Iris API pour gérer les idées et autres ressources.

source: **Iris API** exposes all the methods to manage the data used by the frontend. It also uses the authentication service to validate the user token. And it uses a database and image storage service to store all the data and informations.
fr: **Iris API** exposes toutes les méthodes pour gérer les données utilisées par l'application web. Les endpoints de l'api sont protégées par le même système d'authentification que le frontend, car attend le jeton de l'utilisateur. Il utilise aussi la base de données et le service de stockage d'images pour stocker données, images et informations.

source: Supported authentication services
fr: Systèmes d'authentification supportés

source: Here is the current list of authentication services supported by Iris :
fr: Voici la liste des services d'authentification actuellement supportés par Iris :

source: Supported file storages
fr: Services de stockage de fichiers supportés

source: Here is the current list of file storages supported by Iris :
fr: Voici la liste actuelle des services de stockage de fichiers supportés par Iris :

source: In the server hosting the API
fr: Sur le serveur hébergeant l'API

source: Supported databases
fr: Base de données supportées

source: Here is the current list of databases supported by Iris :
fr: Voici la liste actuelle des bases de données supportées par Iris :

source: More authentication services and file storage providers will be added in the future.
fr: D'autres services d'authentification et de stockage de fichiers seront ajoutés dans le futur.

source: If you want, :doc:`you can contribute<../contribute/contribute>` to request and/or implement them.
fr: Si vous voulez, :doc:`vous pouvez contribuer<../contribute/contribute>` à la demande ou l'implémentation de nouveaux services.
