Repository: RoadTripMoustache/iris-doc
Catalog: docs/source/locale/*/LC_MESSAGES/contribute/contribute.po
Languages: fr

source: Contribute and Support
fr: Contribution et support

source: You have many ways to contribute in this project, you can :
fr: Il y a plusieurs manières pour que vous puissiez contribuer au projet, vous pouvez :

source: Open issues to :
fr: Ouvrir des issues pour :

source: report an issue
fr: remonter un problème

source: request an improvement
fr: demander une amélioration

source: ask some questions
fr: poser des questions

source: Discuss on these opened issues
fr: Échanger concernant les issues ouvertes

source: Contribute in the projects or the documentation
fr: Contribuer sur les projets ou leur documentation

source: And if you want to support the project, **leave a star on our github projects** !
fr: Et si vous voulez supporter le projet, **laissez une étoile sur nos projets github** !

source: Every action you can take will help Iris to live and grow !
fr: Chaque action que vous pourrez faire aideront Iris à vivre et grandir !
